app/controllers/dishes_controller.rb

  def index
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def show
    @dish = Dish.find params[:id]
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hola"], ["created_at", "2023-05-18 04:12:13.037269"], ["updated_at", "2023-05-18 04:12:13.037269"]]

  def destroy
    @dish.destroy
---
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 1]]