app/controllers/home_pages_controller.rb

  def home
    @restaurants = Restaurant.joins(:items).group('restaurants.id').order('COUNT(items.id) DESC').limit(3)
---
SELECT "restaurants".* FROM "restaurants" INNER JOIN "items" ON "items"."restaurant_id" = "restaurants"."id" GROUP BY "restaurants"."id" ORDER BY COUNT(items.id) DESC LIMIT $1  [["LIMIT", 3]]