app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE (name LIKE '%awed%')
---
  def search
    @restaurants = Restaurant.where("name LIKE ?", "%"+ params[:q] +"%")

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.find params[:id]

INSERT INTO "restaurants" ("id", "name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 1], ["name", "awd"], ["address", "3465 sef"], ["created_at", "2023-05-18 04:23:54.849455"], ["updated_at", "2023-05-18 04:23:54.849455"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save